{
  "profiles": [
    {
      "profile_id": "ibm_ds",
      "job_title": "Data Scientist Intern",
      "company": "IBM",
      "jd_text": "Role Overview\n\nYour role and responsibilities\n\nAs a Data Scientist intern in IBM Business Platform Transformation, you will be in a unique position to combine your strategic thinking with your technical skills in AI, machine learning, and data analytics. You will apply your skills to help implement data-driven solutions that align with business goals. You will steer enterprise projects that improve decision-making, solve complex problems, and drive business growth. This role involves working with team members and stakeholders to translate data insights into actionable recommendations that deliver meaningful business impact. \n\nKey Responsibilities\n\nAI, Data Science, and Technical Execution: \nSupport the design, implementation and optimization of AI-driven strategies per business stakeholder requirements.\nDesign and implement machine learning solutions and statistical models, from problem formulation through deployment, to analyze complex datasets and generate actionable insights.\nApply LLMs, GenAI, traditional AI, ML, NLP, computer vision, or predictive analytics where applicable.\nCollect, clean, and preprocess structured and unstructured datasets.\nHelp refine data-driven methodologies for transformation projects. \nLearn and utilize cloud platforms to ensure the scalability of AI solutions.\nLeverage reusable assets and apply IBM standards for data science and development.\nApply ML Ops and AI ethics.\nStrategic Planning\nTranslate business requirements into technical strategies.\nEnsure alignment to stakeholders’ strategic direction and tactical needs.\nApply business acumen to analyze business problems and develop solutions.\nCollaborate with stakeholders and team to prioritize work. \nProject Management and Delivering Business Outcomes: \nManage and contribute to various stages of AI and data science projects, from data exploration to model development to solution implementation and deployment.\nUse agile strategies to manage and execute work.\nMonitor project timelines and help resolve technical challenges. \nDesign and implement measurement frameworks to benchmark AI solutions, quantifying business impact through KPIs. \nCommunication and Collaboration: \nCommunicate regularly and present findings to collaborators and stakeholders, including technical and non-technical audiences.\nCreate compelling data visualizations and dashboards.\nWork with data engineers, software developers, and other team members to integrate AI solutions into existing systems. \nPreferred Education\n\nBachelor's Degree\n\nRequired Technical And Professional Expertise\n\nRequired Education: Pursuing a Bachelor’s degree in Computer Science, Data Science, Statistics, Economics, or a related field.\n\nExperience: Experience with AI/ML technologies and statistical modeling through coursework, projects, or past internships or full-time positions.\n\nTechnical Skills\n\nProficiency in SQL and Python for performing data analysis and developing machine learning models.\nExperience and/or coursework in statistics, machine learning, generative and traditional AI.\nKnowledge of common machine learning algorithms and frameworks: linear regression, decision trees, random forests, gradient boosting (e.g., XGBoost, LightGBM), neural networks, and deep learning frameworks such as TensorFlow and PyTorch.\nFamiliarity with cloud-based platforms and data processing frameworks.\nHands on Experience using large language models (LLMs).\nFamiliarity with object-oriented programming.\nExperience and/or coursework with common Python libraries used by data scientists (e.g., NumPy, Pandas, SciPy, scikit-learn, matplotlib, Seaborn, etc.)\nExperience using AI-powered development tools to accelerate software development and data processing.\n\nStrategic And Analytical Skills\n\nStrategic thinking and business acumen.\nStrong problem-solving abilities and eagerness to learn.\nAbility to work with datasets and derive insights.\nAttention to detail.\n\nCommunications And Soft Skills\n\nExcellent communication skills, with the ability to explain technical concepts clearly.\nIndependent and team-oriented.\nUnderstands AI Ethics principles. \nWorks in an open and inclusive manner.\nAdaptable to fast-paced environments.\nEnthusiasm for learning and applying new technologies.\nGrowth mindset.\nAbility to balance multiple initiatives, prioritize tasks effectively, and meet deadlines in a fast-paced environment.",
      "resume_id": "resume_MLE",
      "created_at": "2025-12-17T06:58:59.196775Z",
      "updated_at": "2025-12-17T06:58:59.196775Z"
    }
  ]
}