{
  "profiles": [
    {
      "profile_id": "lyft_ds_2026",
      "job_title": "Data Science Intern",
      "company": "Lyft",
      "jd_text": "About the job\nAt Lyft, our purpose is to serve and connect. We aim to achieve this by cultivating a work environment where all team members belong and have the opportunity to thrive.\n\nLyft’s Data Science Team builds mathematical models underpinning the platform’s core services. Compared to other technology companies of a similar size, the set of problems that we tackle is incredibly diverse. They cut across optimization, prediction, modeling, inference, transportation, and mapping. We're looking for Masters or PhD students who are passionate about solving mathematical problems with data and are excited about working in a fast-paced, innovative and collegial environment.\n\nWe are hiring for a variety of Data Science interns, focusing on the following specialties:\n\nOptimization: Construct and fit statistical or optimization models that facilitate automated decision making in the app.\n\nMachine Learning: Design, build, tune, and deploy machine learning models with a special emphasis on feature engineering and deployment.\n\nInference: Design and analyze tests in our dynamic marketplace, estimating statistical and ML models to enable better decisions, and developing and evaluating algorithmic policies in our pricing, dispatch, and incentives systems.\n\nYou will report into a Science Manager.\n\nResponsibilities:\n\nPartner with Engineers, Product Managers, and other cross-functional partners to frame problems, both mathematically and within the business context\nPerform exploratory data analysis to gain a deeper understanding of the problem\nWrite production modeling code; collaborate with software engineers to implement algorithms in production\nDesign and run both simulated and live traffic experiments\nAnalyze experimental and observational data; communicate findings including working with partner teams and presentations; facilitate launch decisions\n\nExperience:\n\nCurrently pursuing a Masters or PhD degree in mathematical sciences (Operations Research, Computer Science, Statistics, Applied Mathematics, Theoretical Physics, Behavioral Science, Electrical Engineering, etc.), Economics (Microeconomics Theory, Econometrics etc.), Data Engineering; or a related field; with a graduation date between December 2026 and June 2027 (required)\nAvailable during Summer 2026 for an internship in New York City\nExperience coding in Python (required) or SQL, R; standard data science libraries (NumPy, Scikit-learn, PyTorch, TensorFlow, Keras); and ML Tools & Libraries (NumPy, SpaCy, NLTK, Scikit-learn, TensorFlow, Keras) \nExperimental design and analysis \nExploratory data analysis\nExpertise in one of these specialties: optimization and mathematical modeling, machine learning fundamentals, or probabilistic and statistical modeling\nBonus points: Experience in marketplace design, ridesharing, studying two-sided marketplaces, and/or transportation\n\nBenefits:\n\nGreat medical, dental, and vision insurance options\nMental health benefits\nIn addition to holidays, interns receive 2 days paid time off and 3 days sick time off\n401(k) plan to help save for your future\nPre-tax commuter benefits\nLyft Pink - Lyft team members get an exclusive opportunity to test new benefits of our Ridership Program",
      "resume_id": "resume_ds",
      "created_at": "2025-12-17T21:22:15.292299Z",
      "updated_at": "2025-12-17T21:22:15.292299Z"
    }
  ]
}