{
  "profiles": [
    {
      "profile_id": "linkedin_ai",
      "job_title": "Principal AI Engineer, Ads AI",
      "company": "LinkedIn",
      "jd_text": "Job Description\n\nTeam Overview: \n\nThe Assets, Formats & Placements team is part of our LinkedIn Marketing Solutions (Ads Technology) group. This team has a vision of building a content onboarding and asset generation platform, innovating in new ad formats and experimenting with new ad slot supply that can be monetized.\n\nThe team also owns vertical products like hosting live events and B2B marketing aspects for those events and the strategy to monetize creators & publishers that post high quality video content on LinkedIn.\n\nLocation: \n\nAt LinkedIn, our approach to flexible work is centered on trust and optimized for culture, connection, clarity, and the evolving needs of our business. The work location of this role is hybrid, meaning it will be performed both from home and from a LinkedIn office on select days, as determined by the business needs of the team.\n\nThis role will  be based in New York, NY.\n\nResponsibilities:\n\nAs a Principal AI Engineer you will be setting the technical direction and foundation to build and own algorithms, models, and systems that power our LinkedIn ad tech platform. We are looking for a high performing and high ambition tech lead who will use AI/ML to push the boundaries of our ad stack and meet the future needs of our B2B advertisers.\n\nDefine and execute technical vision for applying AI to accelerate the team’s roadmap which includes asset generation using LLMs, personalizing ads at scale and new workflows that guide advertisers to building higher performing ads.\nMentor and work with other Sr. Staff SWEs in the team to establish quality norms, processes and build a culture of operational excellence.\nPartner with Product, Data Science, and AI Research teams to translate business goals into scalable AI-powered capabilities that improve the advertiser experience & ROI.\nEstablish best practices for experimentation, model evaluation, and responsible AI within the asset generation, ads personalization and supply expansion spaces.\n\n\nQualifications\n\nBasic Qualifications:\n\n5+ years as a Technical Leader (L7, Senior Staff, Principal, etc.) \n7+ years of industry experience with Machine Learning, AI, Data Engineering, or related solutions. \nBachelor of Science (or higher, e.g., MS, or PhD) in Computer Science or related technical field involving coding, or equivalent technical experience.\n\n\nPreferred Qualifications:\n\n10+ years of industry experience (AI, Machine Learning, Data Science, or related) including prior experience working in the Tech domain. \nMaster’s or PhD in Computer Science or a related discipline. \nBS and 12+ years of relevant work experience, MS and 10+ years of relevant work experience, or PhD and 8+ years of relevant work experience.\nPrevious design and implementation of solutions in highly distributed environments. \nExperience in the Advertising and Marketing domain.\nPrior work designing and building scalable agentic systems.\n\n\nSkills:\n\nTechnical Leadership\nAI Engineering \nEnterprise ML Solutions \n\n\nYou will Benefit from our Culture:\n\nWe strongly believe in the well-being of our employees and their families. That is why we offer generous health and wellness programs and time away for employees of all levels.",
      "created_at": "2025-12-14T18:33:22.752744Z",
      "updated_at": "2025-12-14T18:33:22.752744Z"
    },
    {
      "profile_id": "BCG DS Intern 2026",
      "job_title": "Data Scientist Intern",
      "company": "BCG X",
      "jd_text": "Qualifications\nIntermediate proficiency in Python and SQL\nUnderstanding of data analysis techniques and foundational concepts in Calculus, Statistics, and Linear Algebra\nExperience with Data Science methodologies, including machine learning, regression, and classification\n8 more items(s)\nBenefits\nGreat Company Culture\nThe pay range for this position in New York City at the start of employment is expected to be $30 per Hour\nHowever, base pay offered is based on market location, and may vary further depending on individualized factors for job candidates, such as job-related knowledge, skills, experience, and other objective business considerations\n2 more items(s)\nResponsibilities\nWorking in a dynamic environment, you will apply your analytical skills to drive impactful decisions and help build the future of interactive entertainment\nUse statistical analysis, machine learning, and data visualization to uncover data patterns and test hypotheses\nCollaborate with senior analytics staff to determine business needs and implement actionable solutions",
      "resume_id": "BCG DS Intern Summer 2026",
      "created_at": "2025-12-17T10:13:45.276671Z",
      "updated_at": "2025-12-17T10:13:45.276671Z"
    }
  ]
}