{
  "profiles": [
    {
      "profile_id": "ibm_ds",
      "job_title": "Data Scientist Intern",
      "company": "IBM",
      "jd_text": "Role Overview\n\nYour role and responsibilities\n\nAs a Data Scientist intern in IBM Business Platform Transformation, you will be in a unique position to combine your strategic thinking with your technical skills in AI, machine learning, and data analytics. You will apply your skills to help implement data-driven solutions that align with business goals. You will steer enterprise projects that improve decision-making, solve complex problems, and drive business growth. This role involves working with team members and stakeholders to translate data insights into actionable recommendations that deliver meaningful business impact. \n\nKey Responsibilities\n\nAI, Data Science, and Technical Execution: \nSupport the design, implementation and optimization of AI-driven strategies per business stakeholder requirements.\nDesign and implement machine learning solutions and statistical models, from problem formulation through deployment, to analyze complex datasets and generate actionable insights.\nApply LLMs, GenAI, traditional AI, ML, NLP, computer vision, or predictive analytics where applicable.\nCollect, clean, and preprocess structured and unstructured datasets.\nHelp refine data-driven methodologies for transformation projects. \nLearn and utilize cloud platforms to ensure the scalability of AI solutions.\nLeverage reusable assets and apply IBM standards for data science and development.\nApply ML Ops and AI ethics.\nStrategic Planning\nTranslate business requirements into technical strategies.\nEnsure alignment to stakeholders’ strategic direction and tactical needs.\nApply business acumen to analyze business problems and develop solutions.\nCollaborate with stakeholders and team to prioritize work. \nProject Management and Delivering Business Outcomes: \nManage and contribute to various stages of AI and data science projects, from data exploration to model development to solution implementation and deployment.\nUse agile strategies to manage and execute work.\nMonitor project timelines and help resolve technical challenges. \nDesign and implement measurement frameworks to benchmark AI solutions, quantifying business impact through KPIs. \nCommunication and Collaboration: \nCommunicate regularly and present findings to collaborators and stakeholders, including technical and non-technical audiences.\nCreate compelling data visualizations and dashboards.\nWork with data engineers, software developers, and other team members to integrate AI solutions into existing systems. \nPreferred Education\n\nBachelor's Degree\n\nRequired Technical And Professional Expertise\n\nRequired Education: Pursuing a Bachelor’s degree in Computer Science, Data Science, Statistics, Economics, or a related field.\n\nExperience: Experience with AI/ML technologies and statistical modeling through coursework, projects, or past internships or full-time positions.\n\nTechnical Skills\n\nProficiency in SQL and Python for performing data analysis and developing machine learning models.\nExperience and/or coursework in statistics, machine learning, generative and traditional AI.\nKnowledge of common machine learning algorithms and frameworks: linear regression, decision trees, random forests, gradient boosting (e.g., XGBoost, LightGBM), neural networks, and deep learning frameworks such as TensorFlow and PyTorch.\nFamiliarity with cloud-based platforms and data processing frameworks.\nHands on Experience using large language models (LLMs).\nFamiliarity with object-oriented programming.\nExperience and/or coursework with common Python libraries used by data scientists (e.g., NumPy, Pandas, SciPy, scikit-learn, matplotlib, Seaborn, etc.)\nExperience using AI-powered development tools to accelerate software development and data processing.\n\nStrategic And Analytical Skills\n\nStrategic thinking and business acumen.\nStrong problem-solving abilities and eagerness to learn.\nAbility to work with datasets and derive insights.\nAttention to detail.\n\nCommunications And Soft Skills\n\nExcellent communication skills, with the ability to explain technical concepts clearly.\nIndependent and team-oriented.\nUnderstands AI Ethics principles. \nWorks in an open and inclusive manner.\nAdaptable to fast-paced environments.\nEnthusiasm for learning and applying new technologies.\nGrowth mindset.\nAbility to balance multiple initiatives, prioritize tasks effectively, and meet deadlines in a fast-paced environment.",
      "resume_id": "resume_MLE",
      "created_at": "2025-12-17T06:58:59.196775Z",
      "updated_at": "2025-12-17T06:58:59.196775Z"
    },
    {
      "profile_id": "google_mle",
      "job_title": "AI/ML Intern",
      "company": "Google",
      "jd_text": "Duration: 10 Weeks\n\nDate: June 2026 to August 2026\n\nLocation: Hybrid, in Murray Hill, NJ.\n\nEDUCATIONAL RECOMMENDATIONS\n\nCurrently a candidate for a PhD in Computer Science, Computer Systems Engineering, Math, Artificial Intelligence, or related field at an accredited school in the USA.\n\nHow You Will Contribute And What You Will Learn\n\nAre you passionate about solving problems? As part of our team, you will:\n\nDesign and implement state-of-the-art AI/ML decentralized systems.\nValidate and evaluate your implementation in our cutting-edge labs.\nInterface, explore, and learn from the experts.\n\nKey Skills And Experience\n\nExpertise in deep learning fundamentals, including large language models and agent-based systems, and experience with training, deploying, and/or profiling models.\nExperience in principled systems design and development.\nExcellent communication skills, with the ability to analyze complex problems and effectively communicate findings.\nStrong publication record in top-tier AI and systems conferences. \n\nIt would be nice if you also had:\n\nWe encourage applications from candidates who have a strong foundation in one or more of the areas below, even if you don’t meet every criterion. We value diverse perspectives, innovative thinking, and complementary skills.\n\nAgentic AI & Large Language Models (LLMs): Familiarity with large-scale model inference and optimization, as well as experience in LLM reasoning, prompt engineering, and resource-constrained computation. \nAI Systems Architecture & Optimization: Experience managing GPU or accelerator resources, optimizing performance, and benchmarking across different hardware environments. A solid understanding of AI infrastructure design and inference workflows—such as KV-cache management, batching, and offloading—is beneficial. \nCompilers & Hardware–Software Co-Design: Knowledge of computational graph representations (e.g., ONNX, MLIR, XLA, TorchScript) and model optimization frameworks (e.g., TensorRT, TVM). Experience working with heterogeneous accelerator ecosystems (e.g., TPUs, AMD ROCm GPUs) or parallelizing compilers is a plus. \nDistributed, Edge AI & Web3 Computing: Understanding of distributed or edge inference systems (e.g., Ray Serve, DeepSpeed-Inference, vLLM), with familiarity in blockchain technologies, smart contracts, or wireless networking protocols (Wi-Fi, 3GPP, Bluetooth). \n\nAbout Us\n\nAdvancing connectivity to secure a brighter world.\n\nNokia is a global leader in connectivity for the AI era. With expertise across fixed, mobile and transport networks, powered by the innovation of Nokia Bell Labs, we’re advancing connectivity to secure a brighter world.\n\nLearn more about life at Nokia .\n\nAbout The Business Group\n\nThe Strategy and Technology organization drives Nokia’s future innovation by identifying value-creation opportunities, setting a unified company vision, and developing coherent business, technology, and architecture strategies. It establishes a research foundation for new products and solutions while providing critical infrastructure to support secure and effective execution across all Nokia business units.\n\nNokia Bell Labs, the world-renowned industrial research arm of Nokia has pioneered breakthrough foundational technologies over the past 100 years like the transistor, laser, Unix, and solar cell - shaping modern communications, computing and connectivity. Today, it drives innovation in AI, quantum computing, 6G, and space communications, bridging groundbreaking research to real-world applications with meaningful impact on society. With ten Nobel Prizes and five Turing Awards, Nokia Bell Labs continues to define the future of technology.\n\nOur recruitment process\n\nWe act inclusively and respect the uniqueness of people. Our employment decisions are made regardless of race, color, national or ethnic origin, religion, gender, sexual orientation, gender identity or expression, age, marital status, disability, protected veteran status or other characteristics protected by law. We are committed to a culture of inclusion built upon our core value of respect.\n\nIf you’re interested in this role but don’t meet every listed requirement, we still encourage you to apply. Unique backgrounds, perspectives, and experiences enrich our teams, and you may be just the right candidate for this or another opportunity.\n\nThe length of the recruitment process may vary depending on the specific role's requirements. We strive to ensure a smooth and inclusive experience for all candidates. Discover more about the recruitment process at Nokia .\n\nAbout The Team\n\nSome of our benefits for students in the US :\n\nFlexible and hybrid working schemes to balance study, work, and life\nProfessional development events and networking opportunities\nWell-being programs, including Personal Support Service 24/7 - a confidential support channel open to all Nokia employees and their families in challenging situations\nOpportunities to join Nokia Employee Resource Groups (NERGs) and build connections across the organization\nEmployee Growth Solutions, mentorship programs, and coaching support for your career development\nA learning environment that fosters both personal growth and professional development – for your role and beyond",
      "resume_id": "resume_MLE",
      "created_at": "2025-12-17T20:14:17.124655Z",
      "updated_at": "2025-12-17T20:14:17.124655Z"
    }
  ]
}